Tekla Open API Reference for Tekla Structures 2025
ReferenceModel.GetChildren Method
 Returns an enumerator of all the children reference model objects.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public override ModelObjectEnumerator GetChildren()
Public Overrides Function GetChildren As ModelObjectEnumerator
Return Value
Type: ModelObjectEnumerator
A model object enumerator on success, otherwise null.
See Also
Reference
ReferenceModel Class
Tekla.Structures.Model Namespace